Белгипрозем_2017/src/InformationRegisters/ДескрипторыДоступаДляОбъектов/ДескрипторыДоступаДляОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДескрипторыДоступаДляОбъектов</name>
  <resources>
    <name>Дескриптор</name>
    <type>
      <types>CatalogRef.ДескрипторыДоступаОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ТемыОбсуждений</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ШаблоныУтверждения</types>
      <types>CatalogRef.Контроль</types>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.мВидыДатДоговоров</types>
      <types>CatalogRef.ЛичныеАдресаты</types>
      <types>CatalogRef.ПравилаОбработкиПисем</types>
      <types>CatalogRef.НоменклатураДел</types>
      <types>CatalogRef.Инструкции</types>
      <types>DocumentRef.ВходящееСообщениеСВД</types>
      <types>CatalogRef.ПапкиФайлов</types>
      <types>DocumentRef.ИсходящееСообщениеСВД</types>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>CatalogRef.СпискиРассылкиПоКорреспондентам</types>
      <types>CatalogRef.ШаблоныОзнакомления</types>
      <types>CatalogRef.ШаблоныСоставныхБизнесПроцессов</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.КатегорииДанных</types>
      <types>CatalogRef.ВидыМероприятий</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.ЗаписиРабочегоКалендаря</types>
      <types>CatalogRef.РазделыНоменклатурыДел</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>CatalogRef.ШаблоныРассмотрения</types>
      <types>CatalogRef.ШаблоныСогласования</types>
      <types>CatalogRef.Должности</types>
      <types>CatalogRef.ПапкиПисем</types>
      <types>CatalogRef.СпискиАдресовЭлектроннойПочты</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>CatalogRef.Резолюции</types>
      <types>CatalogRef.ШаблоныПоручения</types>
      <types>CatalogRef.ШаблоныКомплексныхБизнесПроцессов</types>
      <types>DocumentRef.ЕжедневныйОтчет</types>
      <types>CatalogRef.ПапкиФорума</types>
      <types>CatalogRef.ГрифыДоступа</types>
      <types>CatalogRef.ВизыСогласования</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.ДелаХраненияДокументов</types>
      <types>CatalogRef.ГруппыКонтактовПользователей</types>
      <types>CatalogRef.ШаблоныПриглашения</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.ШаблоныИсполнения</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <types>CatalogRef.ВопросыДеятельности</types>
      <types>CatalogRef.ШаблоныРегистрации</types>
      <types>DocumentRef.ПередачаДелВАрхив</types>
      <types>CatalogRef.СообщенияЭДО</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
      <types>CatalogRef.ПапкиМероприятий</types>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
      <types>CatalogRef.ГруппыДоступаКорреспондентов</types>
      <types>DocumentRef.УничтожениеДел</types>
      <types>BusinessProcessRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/ОчередьОбновленияПравДоступа/ОчередьОбновленияПравДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОбновленияПравДоступа</name>
  <resources>
    <name>ДатаВМиллиСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбновлениеЗависимыхПрав</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/CommonForms/ДокументооборотПраваДоступаПоОбъекту/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектДоступа = Параметры.ОбъектДоступа;
	
	Элементы.ПраваДоступаУправлениеПравами.Видимость = 
		ДокументооборотПраваДоступа.ЭтоПапка(ТипЗнч(ОбъектДоступа));
	
	Дескриптор = РегистрыСведений.ДескрипторыДоступаДляОбъектов.НайтиДескрипторДляОбъекта(ОбъектДоступа);
	ОбновитьСведенияОбОчереди();
	
	УникальныйИдентификаторДескриптора = Строка(Дескриптор.УникальныйИдентификатор());
	
	ЗаполнитьТаблицуПрав();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСведенияОбОчереди(ПраваОбновлены = Ложь)

	Если Дескриптор <> Неопределено Тогда
		Если РегистрыСведений.ОчередьОбновленияПравДоступа.ОбъектВОчереди(Дескриптор) Тогда
			Элементы.ГруппаСведенияОбОчереди.Видимость = Истина;
			Если ПраваОбновлены Тогда
				Элементы.ТекстСведенийОбОчереди.Заголовок = НСтр("ru = 'Объект находится в очереди.'");
			КонецЕсли;	
		Иначе	
			Элементы.ГруппаСведенияОбОчереди.Видимость = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСервер()
	
	// Определение дескриптора объекта заново
	Дескриптор = РегистрыСведений.ДескрипторыДоступаДляОбъектов.ОпределитьДескрипторДляОбъекта(ОбъектДоступа);
	УникальныйИдентификаторДескриптора = Строка(Дескриптор.УникальныйИдентификатор());
	
	// Расчет прав по новому определителю
	Если ЗначениеЗаполнено(Дескриптор) Тогда
		
		МенеджерДескриптора = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Дескриптор);
		Протокол = Новый Массив;
		МенеджерДескриптора.ОбновитьПрава(
			Дескриптор, 
			Протокол, 
			Истина); // Немедленно
		
		Элементы.СтраницаПротоколРасчетаПрав.Видимость = Истина;
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		
		ПротоколРасчетаПрав.Очистить();
		
		Для каждого Эл Из Протокол Цикл
			
			Строка = ПротоколРасчетаПрав.Добавить();
			Если ТипЗнч(Эл) <> Тип("Строка") Тогда
				Строка.Описание = Строка(Эл) + " (" + Строка(ТипЗнч(Эл)) + ")";
				Строка.Ссылка = Эл;
			Иначе	
				Строка.Описание = Эл;
			КонецЕсли;	
			
		КонецЦикла;
		
		Строка = ПротоколРасчетаПрав.Добавить();
		Строка.Описание = НСтр("ru = 'Неограниченные права на таблицу'");
		
	КонецЕсли;
	
	ЗаполнитьТаблицуПрав();
	ОбновитьСведенияОбОчереди(Истина);
	
КонецПроцедуры

&НаСервере	
Процедура ЗаполнитьТаблицуПрав()
	
	ТаблицаПрав = ДокументооборотПраваДоступа.ПолучитьТаблицуПравДляОтображенияВИнтерфейсе(ОбъектДоступа);
	ПраваДоступа.Загрузить(ТаблицаПрав);
	
КонецПроцедуры

&НаКлиенте
Процедура ПротоколРасчетаПравВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПротоколРасчетаПрав.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
		ПоказатьЗначение(,ТекущиеДанные.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПраваДоступаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПраваДоступа.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(,ТекущиеДанные.Пользователь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УникальныйИдентификаторДескриптораНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Дескриптор);
	
КонецПроцедуры
